In [1]:
#시리즈 (series)
#1차원 배열
#데이터프레임(DataFrame)
#2차원 배열

In [2]:
import pandas as pd

In [3]:
#시리즈 (series)
#1차원 배열
#복수의 행으로 이루어진 하나의 열 구조
#index(색인)을 가지고 원하는 데이터에 접근 할 수있음 + 자동으로 index 생성해줌

pd.Series([7,3,5,8])

0    7
1    3
2    5
3    8
dtype: int64

In [6]:
#자동으로 idnex를 만들지않고 index 키워드를 사용해 원하는 index의 이름을 입력
x= pd.Series([7,3,5,8], index=['서울','대구','부산','광주'])
print(x)
x['서울']

서울    7
대구    3
부산    5
광주    8
dtype: int64

7

In [7]:
x[['서울','대구']]

서울    7
대구    3
dtype: int64

In [8]:
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [9]:
x.values

array([7, 3, 5, 8], dtype=int64)

In [10]:
#sorted()함수
print(sorted(x.index))
print(sorted(x.values))

['광주', '대구', '부산', '서울']
[3, 5, 7, 8]

In [11]:
sorted(x.values) # 정렬을해준다

[3, 5, 7, 8]

In [13]:
x.reindex(sorted(x.index)) #다시 인덱스 설정

광주    8
대구    3
부산    5
서울    7
dtype: int64

In [15]:
x= pd.Series([3,8,5,9],index=['서울','대구','부산','광주'])
y= pd.Series([2,4,5,1],index=['대구','부산','서울','대전'])
x+y

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [24]:
#unique() 시리즈로부터 유일한값을 반환
medal=[1,3,2,4,2,3]
x= pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [25]:
medal = ['민준','현우','서연','동현','서연','현우']
x=pd.Series(medal)
print(pd.unique(x))

['민준' '현우' '서연' '동현']

In [26]:
age={'민준':23,'현우':43,'서연':12,'동현':45}
x = pd.Series(age)
x

민준    23
현우    43
서연    12
동현    45
dtype: int64

In [31]:
x= pdata[3:6]
print(x.values)

NameError: name 'pdata' is not defined

In [ ]:
#데이터프레임
#2차원 배열
#행과 열로 구성
#열에 대한 각각의 이름을 부여

In [29]:
data={'age':[23,43,12,45],
     'name':['민준','현우','서연','동현'],
     'height':[175.3,180.3,165,8,172,7]}
x=pd.DataFrame(data,columns=['name','age','heigth']) #밑에 엑셀형식으로 보여주기
x

  name  age heigth
0   민준   23    NaN
1   현우   43    NaN
2   서연   12    NaN
3   동현   45    NaN

In [30]:
x.name

0    민준
1    현우
2    서연
3    동현
Name: name, dtype: object

In [32]:
ary=[[1,2],[3,4],[5,6]]
data= pd.DataFrame(ary,columns=['First','Second'])
data

   First  Second
0      1       2
1      3       4
2      5       6

In [34]:
# 특정한 행이나 위치의 내용들을 지정하여 출력
data.iloc[1] #1번행의 값들을 출력

First     3
Second    4
Name: 1, dtype: int64

In [35]:
data.iloc[:,-1] #모든 행의 마지막 데이터만을 출력

0    2
1    4
2    6
Name: Second, dtype: int64

In [42]:
#head()
#객체에 제대로된 데이터 타입이 입력됬는지 빠르게 확인하기 좋다
#첫 행부터 입력한 수만큼의 행이 출력됨
#입력하지 않으면 첫 5줄의 행을 출력

ary =[[1,2],[3,4],[5,6],[7,8],[9,10]]
data= pd.DataFrame(ary,columns=['First','Second'])
data.head(2)

   First  Second
0      1       2
1      3       4

In [48]:
#tail
#DataFrame 내의 마지막 n줄의 데이터를 출력
#head와 마찬가지로 객채내에 데이터다입을 확인하는데 유용
#데이터를 정렬하거나 혹은 추가했을떄 결과를 확인하는데도 매우 유용
#head와 마찬가지로 아무입력없을시 5줄을 기본으로 출력
data.tail(2)

   First  Second
3      7       8
4      9      10

In [47]:
ary=[[1,2],[3,4],[5,6],[7,8],[9,10]]
data = pd.DataFrame(ary,columns=['First','Second'])
bools=[False,True,True,False,True]
data.Second[bools]

1     4
2     6
4    10
Name: Second, dtype: int64

In [49]:
ary=[[1,2],[3,4],[5,6],[7,8],[9,10]]
data = pd.DataFrame(ary,columns=['수온','상온'])
data

   수온  상온
0   1   2
1   3   4
2   5   6
3   7   8
4   9  10

In [50]:
data['수온']=data['수온'].astype('float')
data

    수온  상온
0  1.0   2
1  3.0   4
2  5.0   6
3  7.0   8
4  9.0  10

In [51]:
food=pd.read_csv('food.csv')
food.head()

,Series_reference,Period,Data_value,STATUS,UNITS,Subject,Group,Series_title_1
0,CPIM.SE9S01,1999.06,645,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
1,CPIM.SE9S01,1999.07,647,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
2,CPIM.SE9S01,1999.08,645,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
3,CPIM.SE9S01,1999.09,644,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
4,CPIM.SE9S01,1999.10,641,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted

In [59]:
#한글 인코딩 옵션 =utf-8 cp949 euc-kr

In [60]:
accident =pd.read_csv('acci.csv',encoding='euc-kr')
accident

           법규위반 주야   발생건수  사망자수   부상자수     중상     경상  부상신고
0            과속  주    159    34    334    140    178    16
1            과속  야    218    73    348    200    139     9
2   교차로 통행방법 위반  주   8817    82  14031   3915   9530   586
3   교차로 통행방법 위반  야   5904    29   9728   2401   6884   443
4            기타  주   9388   141  14070   4271   9217   582
5            기타  야   6073    56   9218   2348   6457   413
6   보행자 보호의무 위반  주   3772    80   3914   2063   1729   122
7   보행자 보호의무 위반  야   3334    94   3535   1802   1626   107
8          신호위반  주  12552   210  20396   6816  12765   815
9          신호위반  야  12755   179  21724   7177  13749   798
10     안전거리 미확보  주  12408    57  22392   4509  16882  1001
11     안전거리 미확보  야   9867    40  17422   3025  13644   753
12  안전운전 의무 불이행  주  62608  1740  91076  28081  58472  4523
13  안전운전 의무 불이행  야  62783  2132  92942  26451  62209  4282
14       중앙선 침범  주   6825   243  12427   4658   7339   430
15       중앙선 침범  야   6193   202  11008   3846   6770   392